Pandas is a data-centric python library build on top of numpy and matplotlib to give a single convienient place to do most of your data analysis and visualization work.

# Object Creation in Pandas

In [42]:
import pandas as pd

There are multiple ways of dataframe creation on python.
Some of the common ways are
1. From NumpyArrays
2. From Dictionaries
3. From Files

In [43]:
## Creating Pandas Dataframes from NumpyArrays
import numpy as np
mydata = np.array([[" ","Col 1","Col 2"],[1,2,3],[4,5,6]])
df_nparray = pd.DataFrame(data=mydata[1:,1:],index=mydata[1:,0],columns=mydata[0,1:])
print(df_nparray , "\n Shape of the dataframe" , df_nparray.shape)

  Col 1 Col 2
1     2     3
4     5     6
 Shape of the dataframe (2, 2)

In [44]:
#Creating Pandas Dataframes from Dictionaries
df_dict = pd.DataFrame(data = ({'Col 1' : [1,4] , 'Col 2' : [2,5] , 'Col 3': [3,6]}))  
print(df_dict , "\n Shape of the dataframe" , df_dict.shape)

   Col 1  Col 2  Col 3
0      1      2      3
1      4      5      6
 Shape of the dataframe (2, 3)

In [45]:
url="https://raw.githubusercontent.com/cs109/2014_data/master/countries.csv"
df_url=pd.read_csv(url)
print(df_url , "\n Shape of the dataframe" , df_url.shape)

                              Country         Region
0                             Algeria         AFRICA
1                              Angola         AFRICA
2                               Benin         AFRICA
3                            Botswana         AFRICA
4                             Burkina         AFRICA
5                             Burundi         AFRICA
6                            Cameroon         AFRICA
7                          Cape Verde         AFRICA
8            Central African Republic         AFRICA
9                                Chad         AFRICA
10                            Comoros         AFRICA
11                              Congo         AFRICA
12      Congo, Democratic Republic of         AFRICA
13                           Djibouti         AFRICA
14                              Egypt         AFRICA
15                  Equatorial Guinea         AFRICA
16                            Eritrea         AFRICA
17                           Ethiopia         AFRICA
18                              Gabon         AFRICA
19                             Gambia         AFRICA
20                              Ghana         AFRICA
21                             Guinea         AFRICA
22                      Guinea-Bissau         AFRICA
23                        Ivory Coast         AFRICA
24                              Kenya         AFRICA
25                            Lesotho         AFRICA
26                            Liberia         AFRICA
27                              Libya         AFRICA
28                         Madagascar         AFRICA
29                             Malawi         AFRICA
..                                ...            ...
164                       Saint Lucia  NORTH AMERICA
165  Saint Vincent and the Grenadines  NORTH AMERICA
166               Trinidad and Tobago  NORTH AMERICA
167                     United States  NORTH AMERICA
168                         Australia        OCEANIA
169                              Fiji        OCEANIA
170                          Kiribati        OCEANIA
171                  Marshall Islands        OCEANIA
172                        Micronesia        OCEANIA
173                             Nauru        OCEANIA
174                       New Zealand        OCEANIA
175                             Palau        OCEANIA
176                  Papua New Guinea        OCEANIA
177                             Samoa        OCEANIA
178                   Solomon Islands        OCEANIA
179                             Tonga        OCEANIA
180                            Tuvalu        OCEANIA
181                           Vanuatu        OCEANIA
182                         Argentina  SOUTH AMERICA
183                           Bolivia  SOUTH AMERICA
184                            Brazil  SOUTH AMERICA
185                             Chile  SOUTH AMERICA
186                          Colombia  SOUTH AMERICA
187                           Ecuador  SOUTH AMERICA
188                            Guyana  SOUTH AMERICA
189                          Paraguay  SOUTH AMERICA
190                              Peru  SOUTH AMERICA
191                          Suriname  SOUTH AMERICA
192                           Uruguay  SOUTH AMERICA
193                         Venezuela  SOUTH AMERICA

[194 rows x 2 columns]
 Shape of the dataframe (194, 2)

In [46]:
df_url.head(5)

    Country  Region
0   Algeria  AFRICA
1    Angola  AFRICA
2     Benin  AFRICA
3  Botswana  AFRICA
4   Burkina  AFRICA

In [47]:
df_url.tail(5)

       Country         Region
189   Paraguay  SOUTH AMERICA
190       Peru  SOUTH AMERICA
191   Suriname  SOUTH AMERICA
192    Uruguay  SOUTH AMERICA
193  Venezuela  SOUTH AMERICA

In [48]:
df_url.values

array([['Algeria', 'AFRICA'],
       ['Angola', 'AFRICA'],
       ['Benin', 'AFRICA'],
       ['Botswana', 'AFRICA'],
       ['Burkina', 'AFRICA'],
       ['Burundi', 'AFRICA'],
       ['Cameroon', 'AFRICA'],
       ['Cape Verde', 'AFRICA'],
       ['Central African Republic', 'AFRICA'],
       ['Chad', 'AFRICA'],
       ['Comoros', 'AFRICA'],
       ['Congo', 'AFRICA'],
       ['Congo, Democratic Republic of', 'AFRICA'],
       ['Djibouti', 'AFRICA'],
       ['Egypt', 'AFRICA'],
       ['Equatorial Guinea', 'AFRICA'],
       ['Eritrea', 'AFRICA'],
       ['Ethiopia', 'AFRICA'],
       ['Gabon', 'AFRICA'],
       ['Gambia', 'AFRICA'],
       ['Ghana', 'AFRICA'],
       ['Guinea', 'AFRICA'],
       ['Guinea-Bissau', 'AFRICA'],
       ['Ivory Coast', 'AFRICA'],
       ['Kenya', 'AFRICA'],
       ['Lesotho', 'AFRICA'],
       ['Liberia', 'AFRICA'],
       ['Libya', 'AFRICA'],
       ['Madagascar', 'AFRICA'],
       ['Malawi', 'AFRICA'],
       ['Mali', 'AFRICA'],
       ['Mauritania', 'AFRICA'],
       ['Mauritius', 'AFRICA'],
       ['Morocco', 'AFRICA'],
       ['Mozambique', 'AFRICA'],
       ['Namibia', 'AFRICA'],
       ['Niger', 'AFRICA'],
       ['Nigeria', 'AFRICA'],
       ['Rwanda', 'AFRICA'],
       ['Sao Tome and Principe', 'AFRICA'],
       ['Senegal', 'AFRICA'],
       ['Seychelles', 'AFRICA'],
       ['Sierra Leone', 'AFRICA'],
       ['Somalia', 'AFRICA'],
       ['South Africa', 'AFRICA'],
       ['South Sudan', 'AFRICA'],
       ['Sudan', 'AFRICA'],
       ['Swaziland', 'AFRICA'],
       ['Tanzania', 'AFRICA'],
       ['Togo', 'AFRICA'],
       ['Tunisia', 'AFRICA'],
       ['Uganda', 'AFRICA'],
       ['Zambia', 'AFRICA'],
       ['Zimbabwe', 'AFRICA'],
       ['Afghanistan', 'ASIA'],
       ['Bahrain', 'ASIA'],
       ['Bangladesh', 'ASIA'],
       ['Bhutan', 'ASIA'],
       ['Brunei', 'ASIA'],
       ['Burma', 'ASIA'],
       ['Cambodia', 'ASIA'],
       ['China', 'ASIA'],
       ['East Timor', 'ASIA'],
       ['India', 'ASIA'],
       ['Indonesia', 'ASIA'],
       ['Iran', 'ASIA'],
       ['Iraq', 'ASIA'],
       ['Israel', 'ASIA'],
       ['Japan', 'ASIA'],
       ['Jordan', 'ASIA'],
       ['Kazakhstan', 'ASIA'],
       ['Korea, North', 'ASIA'],
       ['Korea, South', 'ASIA'],
       ['Kuwait', 'ASIA'],
       ['Kyrgyzstan', 'ASIA'],
       ['Laos', 'ASIA'],
       ['Lebanon', 'ASIA'],
       ['Malaysia', 'ASIA'],
       ['Maldives', 'ASIA'],
       ['Mongolia', 'ASIA'],
       ['Nepal', 'ASIA'],
       ['Oman', 'ASIA'],
       ['Pakistan', 'ASIA'],
       ['Philippines', 'ASIA'],
       ['Qatar', 'ASIA'],
       ['Russian Federation', 'ASIA'],
       ['Saudi Arabia', 'ASIA'],
       ['Singapore', 'ASIA'],
       ['Sri Lanka', 'ASIA'],
       ['Syria', 'ASIA'],
       ['Tajikistan', 'ASIA'],
       ['Thailand', 'ASIA'],
       ['Turkey', 'ASIA'],
       ['Turkmenistan', 'ASIA'],
       ['United Arab Emirates', 'ASIA'],
       ['Uzbekistan', 'ASIA'],
       ['Vietnam', 'ASIA'],
       ['Yemen', 'ASIA'],
       ['Albania', 'EUROPE'],
       ['Andorra', 'EUROPE'],
       ['Armenia', 'EUROPE'],
       ['Austria', 'EUROPE'],
       ['Azerbaijan', 'EUROPE'],
       ['Belarus', 'EUROPE'],
       ['Belgium', 'EUROPE'],
       ['Bosnia and Herzegovina', 'EUROPE'],
       ['Bulgaria', 'EUROPE'],
       ['Croatia', 'EUROPE'],
       ['Cyprus', 'EUROPE'],
       ['Czech Republic', 'EUROPE'],
       ['Denmark', 'EUROPE'],
       ['Estonia', 'EUROPE'],
       ['Finland', 'EUROPE'],
       ['France', 'EUROPE'],
       ['Georgia', 'EUROPE'],
       ['Germany', 'EUROPE'],
       ['Greece', 'EUROPE'],
       ['Hungary', 'EUROPE'],
       ['Iceland', 'EUROPE'],
       ['Ireland', 'EUROPE'],
       ['Italy', 'EUROPE'],
       ['Latvia', 'EUROPE'],
       ['Liechtenstein', 'EUROPE'],
       ['Lithuania', 'EUROPE'],
       ['Luxembourg', 'EUROPE'],
       ['Macedonia', 'EUROPE'],
       ['Malta', 'EUROPE'],
       ['Moldova', 'EUROPE'],
       ['Monaco', 'EUROPE'],
       ['Montenegro', 'EUROPE'],
       ['Netherlands', 'EUROPE'],
       ['Norway', 'EUROPE'],
       ['Poland', 'EUROPE'],
       ['Portugal', 'EUROPE'],
       ['Romania', 'EUROPE'],
       ['San Marino', 'EUROPE'],
       ['Serbia', 'EUROPE'],
       ['Slovakia', 'EUROPE'],
       ['Slovenia', 'EUROPE'],
       ['Spain', 'EUROPE'],
       ['Sweden', 'EUROPE'],
       ['Switzerland', 'EUROPE'],
       ['Ukraine', 'EUROPE'],
       ['United Kingdom', 'EUROPE'],
       ['Vatican City', 'EUROPE'],
       ['Antigua and Barbuda', 'NORTH AMERICA'],
       ['Bahamas', 'NORTH AMERICA'],
       ['Barbados', 'NORTH AMERICA'],
       ['Belize', 'NORTH AMERICA'],
       ['Canada', 'NORTH AMERICA'],
       ['Costa Rica', 'NORTH AMERICA'],
       ['Cuba', 'NORTH AMERICA'],
       ['Dominica', 'NORTH AMERICA'],
       ['Dominican Republic', 'NORTH AMERICA'],
       ['El Salvador', 'NORTH AMERICA'],
       ['Grenada', 'NORTH AMERICA'],
       ['Guatemala', 'NORTH AMERICA'],
       ['Haiti', 'NORTH AMERICA'],
       ['Honduras', 'NORTH AMERICA'],
       ['Jamaica', 'NORTH AMERICA'],
       ['Mexico', 'NORTH AMERICA'],
       ['Nicaragua', 'NORTH AMERICA'],
       ['Panama', 'NORTH AMERICA'],
       ['Saint Kitts and Nevis', 'NORTH AMERICA'],
       ['Saint Lucia', 'NORTH AMERICA'],
       ['Saint Vincent and the Grenadines', 'NORTH AMERICA'],
       ['Trinidad and Tobago', 'NORTH AMERICA'],
       ['United States', 'NORTH AMERICA'],
       ['Australia', 'OCEANIA'],
       ['Fiji', 'OCEANIA'],
       ['Kiribati', 'OCEANIA'],
       ['Marshall Islands', 'OCEANIA'],
       ['Micronesia', 'OCEANIA'],
       ['Nauru', 'OCEANIA'],
       ['New Zealand', 'OCEANIA'],
       ['Palau', 'OCEANIA'],
       ['Papua New Guinea', 'OCEANIA'],
       ['Samoa', 'OCEANIA'],
       ['Solomon Islands', 'OCEANIA'],
       ['Tonga', 'OCEANIA'],
       ['Tuvalu', 'OCEANIA'],
       ['Vanuatu', 'OCEANIA'],
       ['Argentina', 'SOUTH AMERICA'],
       ['Bolivia', 'SOUTH AMERICA'],
       ['Brazil', 'SOUTH AMERICA'],
       ['Chile', 'SOUTH AMERICA'],
       ['Colombia', 'SOUTH AMERICA'],
       ['Ecuador', 'SOUTH AMERICA'],
       ['Guyana', 'SOUTH AMERICA'],
       ['Paraguay', 'SOUTH AMERICA'],
       ['Peru', 'SOUTH AMERICA'],
       ['Suriname', 'SOUTH AMERICA'],
       ['Uruguay', 'SOUTH AMERICA'],
       ['Venezuela', 'SOUTH AMERICA']], dtype=object)

In [49]:
df_url.columns

Index(['Country', 'Region'], dtype='object')

In [50]:
df_url.index

RangeIndex(start=0, stop=194, step=1)

In [51]:
df_url.count()

Country    194
Region     194
dtype: int64

In [52]:
df_url.describe()

         Country  Region
count        194     194
unique       194       6
top     Slovenia  AFRICA
freq           1      54

In [53]:
df_dict.describe()

         Col 1    Col 2    Col 3
count  2.00000  2.00000  2.00000
mean   2.50000  3.50000  4.50000
std    2.12132  2.12132  2.12132
min    1.00000  2.00000  3.00000
25%    1.75000  2.75000  3.75000
50%    2.50000  3.50000  4.50000
75%    3.25000  4.25000  5.25000
max    4.00000  5.00000  6.00000

# Data Manipulation

In [54]:
df_url['Region'].describe()
df_url.head(3)

   Country  Region
0  Algeria  AFRICA
1   Angola  AFRICA
2    Benin  AFRICA

# Indexing

In [96]:

newDataFrame =pd.DataFrame({'RollNo' : [1,2,3,4,4] ,
                             'Name' : ['Jayesh','Amresh','Abhijit','Mandar','Kedar'],
                             'Stream' : ['Web Development' ,'Mobile Development' , 'Project Management' , 'Management' , 'Software Development']})

In [97]:
newDataFrame.columns

Index(['Name', 'RollNo', 'Stream'], dtype='object')

In [98]:
newDataFrame.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
Name      5 non-null object
RollNo    5 non-null int64
Stream    5 non-null object
dtypes: int64(1), object(2)
memory usage: 200.0+ bytes

In [99]:
newDataFrame.index.name = 'Numeric Index'

In [100]:
newDataFrame.head()

                  Name  RollNo                Stream
Numeric Index
0               Jayesh       1       Web Development
1               Amresh       2    Mobile Development
2              Abhijit       3    Project Management
3               Mandar       4            Management
4                Kedar       4  Software Development

In [101]:
newDataFrame.head()

                  Name  RollNo                Stream
Numeric Index
0               Jayesh       1       Web Development
1               Amresh       2    Mobile Development
2              Abhijit       3    Project Management
3               Mandar       4            Management
4                Kedar       4  Software Development

In [102]:
newDataFrame.loc[2,'Name']

'Abhijit'

In [103]:
newDataFrame.reset_index(inplace=True)

In [104]:
newDataFrame.head()

   Numeric Index     Name  RollNo                Stream
0              0   Jayesh       1       Web Development
1              1   Amresh       2    Mobile Development
2              2  Abhijit       3    Project Management
3              3   Mandar       4            Management
4              4    Kedar       4  Software Development

In [105]:
newDataFrame.set_index(['RollNo','Name'] , inplace=True)

In [106]:
newDataFrame.index

MultiIndex(levels=[[1, 2, 3, 4], ['Abhijit', 'Amresh', 'Jayesh', 'Kedar', 'Mandar']],
           labels=[[0, 1, 2, 3, 3], [2, 1, 0, 4, 3]],
           names=['RollNo', 'Name'])

In [112]:
newDataFrame.loc[(4,'Mandar'),'Stream']

'Management'